---
kind: property
id: P:Autodesk.Revit.DB.ViewFamilyType.ViewFamily
source: html/6d9d442e-21d5-0932-82a3-3f42f8c565cf.htm
---
# Autodesk.Revit.DB.ViewFamilyType.ViewFamily Property

The ViewFamily for this view type.

## Syntax (C#)
```csharp
public ViewFamily ViewFamily { get; }
```